In [1]:
import sqlite3

In [3]:
db=sqlite3.connect("my_testbase.db")

In [4]:
cursor=db.cursor()

In [6]:
import pandas as pd

In [8]:
stud_de=pd.read_csv("https://raw.githubusercontent.com/training-ml/Files/main/Students_details.csv")

In [9]:
stud_de.to_csv('Students_details.csv',index=False)

In [10]:
cursor.execute("create table stud_de(phone_number int, student_name text, enrolled_date text, marks int)")

In [24]:
with open('Students_details.csv','r')as file:
    no_records=0
    for row in file:
        cursor.execute('insert into stud_de values(?,?,?,?)',row.split(","))
        
        db.commit()
        no_records+=1
print(no_records,'records inserted ','\n'*3)

20 records inserted

In [25]:
result=cursor.execute("select* from stud_de")
for row in result:
    print(row)

(9988776604, 'Salah', '03-10-2020', 85)
(9988776605, 'Heung-Son', '21-06-2020', 39)
(9988776606, 'Ronaldo', '08-05-2020', 86)
(9988776607, 'Kane', '11-05-2022', 57)
(9988776608, 'Mane', '17-05-2022', 52)
(6609998877, 'Vardy', '17-12-2020', 54)
(6609998878, 'Jota', '06-11-2021', 45)
(6609998879, 'Bruyne', '26-11-2020', 49)
(6609998880, 'Zaha', '05-12-2020', 88)
(6609998881, 'Sterling', '29-10-2020', 61)
(9988776614, 'Toney', '31-03-2022', 71)
(9988776615, 'Maddison', '10-03-2020', 44)
(1687799866, 'Bowen', '14-02-2021', 96)
(1687799867, 'Saka', '19-12-2022', 92)
(1687799868, 'Watkins', '30-01-2021', 49)
(1687799869, 'Mount', '16-09-2022', 48)
(1687799870, 'Raphael', '15-05-2021', 50)
(1687799871, 'Mahrez', '30-10-2021', 72)
(9988776622, 'Pukki', '19-02-2021', 93)
(9988776623, 'Fernandes', '01-03-2022', 94)

In [26]:
import pandas as pd

In [28]:
cursor.execute("select * from stud_de")

In [30]:
df=pd.DataFrame (cursor.fetchall())
print(df)

             0          1           2   3
0   9988776604      Salah  03-10-2020  85
1   9988776605  Heung-Son  21-06-2020  39
2   9988776606    Ronaldo  08-05-2020  86
3   9988776607       Kane  11-05-2022  57
4   9988776608       Mane  17-05-2022  52
5   6609998877      Vardy  17-12-2020  54
6   6609998878       Jota  06-11-2021  45
7   6609998879     Bruyne  26-11-2020  49
8   6609998880       Zaha  05-12-2020  88
9   6609998881   Sterling  29-10-2020  61
10  9988776614      Toney  31-03-2022  71
11  9988776615   Maddison  10-03-2020  44
12  1687799866      Bowen  14-02-2021  96
13  1687799867       Saka  19-12-2022  92
14  1687799868    Watkins  30-01-2021  49
15  1687799869      Mount  16-09-2022  48
16  1687799870    Raphael  15-05-2021  50
17  1687799871     Mahrez  30-10-2021  72
18  9988776622      Pukki  19-02-2021  93
19  9988776623  Fernandes  01-03-2022  94

In [31]:
cursor.description

(('phone_number', None, None, None, None, None, None),
 ('student_name', None, None, None, None, None, None),
 ('enrolled_date', None, None, None, None, None, None),
 ('marks', None, None, None, None, None, None))

In [32]:
df.columns=[x[0]for x in cursor.description]
df.head()

   phone_number student_name enrolled_date  marks
0    9988776604        Salah    03-10-2020     85
1    9988776605    Heung-Son    21-06-2020     39
2    9988776606      Ronaldo    08-05-2020     86
3    9988776607         Kane    11-05-2022     57
4    9988776608         Mane    17-05-2022     52

In [33]:
df.tail()

    phone_number student_name enrolled_date  marks
15    1687799869        Mount    16-09-2022     48
16    1687799870      Raphael    15-05-2021     50
17    1687799871       Mahrez    30-10-2021     72
18    9988776622        Pukki    19-02-2021     93
19    9988776623    Fernandes    01-03-2022     94

In [34]:
sql="drop table stud_de"
cursor.execute(sql)